TaLucGiaHoang/SW-TM4C/TivaWare_C_Series-2.1.4.178/sensorlib/hw_lsm303d.h
//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT2_CFG
// register.
//
//*****************************************************************************
#define LSM303D_INT2_CFG_ANDOR_M                                              \
                                0x80        // AND/OR combination of Interrupt
                                            // events; default value: 0
#define LSM303D_INT2_CFG_ANDOR_OR                                             \
                                0x00
#define LSM303D_INT2_CFG_ANDOR_AND                                            \
                                0x80
#define LSM303D_INT2_CFG_6D_M   0x40        // 6-direction function enabled
#define LSM303D_INT2_CFG_6D_EN  0x40
#define LSM303D_INT2_CFG_ZHI_M  0x20        // enable interrupt generation on
                                            // Z-hi event
#define LSM303D_INT2_CFG_ZHI_EN 0x20
#define LSM303D_INT2_CFG_ZLI_M  0x10        // enable interrupt generation on
                                            // Z-low event
#define LSM303D_INT2_CFG_ZLI_EN 0x10
#define LSM303D_INT2_CFG_YHI_M  0x08        // enable interrupt generation on
                                            // Y-hi event
#define LSM303D_INT2_CFG_YHI_EN 0x08
#define LSM303D_INT2_CFG_YLI_M  0x04        // enable interrupt generation on
                                            // Y-low event
#define LSM303D_INT2_CFG_YLI_EN 0x04
#define LSM303D_INT2_CFG_XHI_M  0x02        // enable interrupt generation on
                                            // X-hi event
#define LSM303D_INT2_CFG_XHI_EN 0x02
#define LSM303D_INT2_CFG_XLI_M  0x01        // enable interrupt generation on
                                            // X-low event
#define LSM303D_INT2_CFG_XLI_EN 0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT2_SRC
// register.
//
//*****************************************************************************
#define LSM303D_INT2_SRC_ZERO_M 0x80        // This bit must be zero
#define LSM303D_INT2_SRC_ZERO_ZERO                                            \
                                0x00
#define LSM303D_INT2_SRC_ZERO_INVALID                                         \
                                0x80
#define LSM303D_INT2_SRC_IA_M   0x40        // interrupt active
#define LSM303D_INT2_SRC_IA_ACTIVE                                            \
                                0x40
#define LSM303D_INT2_SRC_ZH_M   0x20        // Z-Hi event occurred
#define LSM303D_INT2_SRC_ZH_OCCURRED                                          \
                                0x20
#define LSM303D_INT2_SRC_ZL_M   0x10        // Z-Low event occurred
#define LSM303D_INT2_SRC_ZL_OCCURRED                                          \
                                0x10
#define LSM303D_INT2_SRC_YH_M   0x08        // Y-Hi event occurred
#define LSM303D_INT2_SRC_YH_OCCURRED                                          \
                                0x08
#define LSM303D_INT2_SRC_YL_M   0x04        // Y-Low event occurred
#define LSM303D_INT2_SRC_YL_OCCURRED                                          \
                                0x04
#define LSM303D_INT2_SRC_XH_M   0x02        // X-Hi event occurred
#define LSM303D_INT2_SRC_XH_OCCURRED                                          \
                                0x02
#define LSM303D_INT2_SRC_XL_M   0x01        // X-Low event occurred
#define LSM303D_INT2_SRC_XL_OCCURRED                                          \
                                0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT2_THS
// register.
//
//*****************************************************************************
#define LSM303D_INT2_THS_ZERO_M 0x80        // This bit must be zero
#define LSM303D_INT2_THS_ZERO_ZERO                                            \
                                0x00
#define LSM303D_INT2_THS_ZERO_INVALID                                         \
                                0x80
#define LSM303D_INT2_THS_THS_M  0x7F        // THS[6-0] Interrupt threshold,
                                            // default 0x0
#define LSM303D_INT2_THS_THS_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_INT2_DURATION
// register.
//
//*****************************************************************************
#define LSM303D_INT2_DURATION_ZERO_M                                          \
                                0x80        // This bit must be zero
#define LSM303D_INT2_DURATION_ZERO_ZERO                                       \
                                0x00
#define LSM303D_INT2_DURATION_ZERO_INVALID                                    \
                                0x80
#define LSM303D_INT2_DURATION_DURATION_M                                      \
                                0x7F        // Duration D[6-0]
#define LSM303D_INT2_DURATION_DURATION_S                                      \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CLICK_CFG
// register.
//
//*****************************************************************************
#define LSM303D_CLICK_CFG_ZD_M  0x20        // Enable interrupt double click on
                                            // Z axis
#define LSM303D_CLICK_CFG_ZD_DIS                                              \
                                0x00
#define LSM303D_CLICK_CFG_ZD_EN 0x20
#define LSM303D_CLICK_CFG_ZS_M  0x10        // Enable interrupt single click on
                                            // Z axis
#define LSM303D_CLICK_CFG_ZS_DIS                                              \
                                0x00
#define LSM303D_CLICK_CFG_ZS_EN 0x10
#define LSM303D_CLICK_CFG_YD_M  0x08        // Enable interrupt double click on
                                            // Y axis
#define LSM303D_CLICK_CFG_YD_DIS                                              \
                                0x00
#define LSM303D_CLICK_CFG_YD_EN 0x08
#define LSM303D_CLICK_CFG_YS_M  0x04        // Enable interrupt single click on
                                            // Y axis
#define LSM303D_CLICK_CFG_YS_DIS                                              \
                                0x00
#define LSM303D_CLICK_CFG_YS_EN 0x04
#define LSM303D_CLICK_CFG_XD_M  0x02        // Enable interrupt double click on
                                            // X axis
#define LSM303D_CLICK_CFG_XD_DIS                                              \
                                0x00
#define LSM303D_CLICK_CFG_XD_EN 0x02
#define LSM303D_CLICK_CFG_XS_M  0x01        // Enable interrupt single click on
                                            // X axis
#define LSM303D_CLICK_CFG_XS_DIS                                              \
                                0x00
#define LSM303D_CLICK_CFG_XS_EN 0x01

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CLICK_SRC
// register.
//
//*****************************************************************************
#define LSM303D_CLICK_SRC_IA_M  0x40        // Interrupt pending
#define LSM303D_CLICK_SRC_IA_NONE                                             \
                                0x00
#define LSM303D_CLICK_SRC_IA_PENDING                                          \
                                0x40
#define LSM303D_CLICK_SRC_DCLICK_M                                            \
                                0x20        // double click-click enable
#define LSM303D_CLICK_SRC_DCLICK_DIS                                          \
                                0x00
#define LSM303D_CLICK_SRC_DCLICK_EN                                           \
                                0x20
#define LSM303D_CLICK_SRC_SCLICK_M                                            \
                                0x10        // single click-click enable
#define LSM303D_CLICK_SRC_SCLICK_DIS                                          \
                                0x00
#define LSM303D_CLICK_SRC_SCLICK_EN                                           \
                                0x10
#define LSM303D_CLICK_SRC_SIGN_M                                              \
                                0x08        // click-click sign
#define LSM303D_CLICK_SRC_SIGN_POSITIVE                                       \
                                0x00
#define LSM303D_CLICK_SRC_SIGN_NEGATIVE                                       \
                                0x08
#define LSM303D_CLICK_SRC_AXIS_M                                              \
                                0x7         // Axis click detection
#define LSM303D_CLICK_SRC_AXIS_X                                              \
                                0x01        // X click-click detection
#define LSM303D_CLICK_SRC_AXIS_Y                                              \
                                0x02        // Y click-click detection
#define LSM303D_CLICK_SRC_AXIS_Z                                              \
                                0x04        // Z click-click detection
#define LSM303D_CLICK_SRC_AXIS_S                                              \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_CLICK_THS
// register.
//
//*****************************************************************************
#define LSM303D_CLICK_THS_THS_M 0x7F        // Threshold; 1 LSB = full-scale /
                                            // 128; THS6 through THS0 define
                                            // the threshold which is used by
                                            // the system to start the click
                                            // detection procedure; the
                                            // threshold value is expressed
                                            // over 7 bits as an unsigned
                                            // number
#define LSM303D_CLICK_THS_THS_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_TIME_LIMIT
// register.
//
//*****************************************************************************
#define LSM303D_TIME_LIMIT_TLI_M                                              \
                                0x7F        // Time Limit; 1 LSB = 1/ODR; TLI7
                                            // through TLI0 define the maximum
                                            // time interval that can elapse
                                            // between the start of the click
                                            // detection procedure (the
                                            // acceleration on the selected
                                            // channel exceeds the programmed
                                            // threshold) and when the
                                            // acceleration goes back below the
                                            // threshold
#define LSM303D_TIME_LIMIT_TLI_S                                              \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_ACT_THS
// register.
//
//*****************************************************************************
#define LSM303D_ACT_THS_THRESHOLD_M                                           \
                                0x7F
#define LSM303D_ACT_THS_THRESHOLD_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the LSM303D_O_ACT_DUR
// register.
//
//*****************************************************************************
#define LSM303D_ACT_DUR_THRESHOLD_M                                           \
                                0x7F
#define LSM303D_ACT_DUR_THRESHOLD_S                                           \
                                0

#endif // __SENSORLIB_HW_LSM303D_H__
